In [ ]:
import requests
import re
from bs4 import BeautifulSoup
import pandas as pd

In [2]:
def extract_glassdoor_info(url):
   headers = {'User-Agent': 'Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/75.0.3770.100 Safari/537.36'}
   html = requests.get(url, headers=headers).content
   soup = BeautifulSoup(html, "lxml")
   salary_text = soup.find_all("p", class_="occMedianModule__SeoTextStyle__description tightVert")
   salary_text = str(salary_text)
   salary_list = re.findall("[€|£|\$]\S*", salary_text)
   job_name_list = re.findall("(?<=for\sa\s)\w+\s\w+\s\w+", salary_text)
   country_name_list = re.findall("\w+(?=\.\sFilter)", salary_text)
   salary_info_list = []
   salary_info_list.append(job_name_list[0])
   salary_info_list.append(country_name_list[0])
   salary_info_list.append(salary_list[0])
   return salary_info_list

Dictionary for analyst: Country --> URL to Webpage

In [3]:
country_job_dict = {"Spain_Analyst" : "https://www.glassdoor.com/Salaries/spain-data-analyst-salary-SRCH_IL.0,5_IN219_KO6,18.htm", "Germany_Analyst": "https://www.glassdoor.com/Salaries/germany-data-analyst-salary-SRCH_IL.0,7_IN96_KO8,20.htm", "France_Analyst": "https://www.glassdoor.com/Salaries/france-data-analyst-salary-SRCH_IL.0,6_IN86_KO7,19.htm", "UK_Analyst": "https://www.glassdoor.com/Salaries/uk-data-analyst-salary-SRCH_IL.0,2_IN2_KO3,15.htm", "USA_Analyst": "https://www.glassdoor.com/Salaries/us-data-analyst-salary-SRCH_IL.0,2_IN1_KO3,15.htm", "Spain_Scientist" : "https://www.glassdoor.com/Salaries/spain-data-scientist-salary-SRCH_IL.0,5_IN219_KO6,20.htm", "Germany_Scientist": "https://www.glassdoor.com/Salaries/germany-data-scientist-salary-SRCH_IL.0,7_IN96_KO8,22.htm", "France_Scientist": "https://www.glassdoor.com/Salaries/france-data-scientist-salary-SRCH_IL.0,6_IN86_KO7,21.htm", "UK_Scientist": "https://www.glassdoor.com/Salaries/uk-data-scientist-salary-SRCH_IL.0,2_IN2_KO3,17.htm", "USA_Scientist": "https://www.glassdoor.com/Salaries/us-data-scientist-salary-SRCH_IL.0,2_IN1_KO3,17.htm", "Spain_FinAnalyst": "https://www.glassdoor.com/Salaries/spain-financial-analyst-salary-SRCH_IL.0,5_IN219_KO6,23.htm", "France_FinAnalyst": "https://www.glassdoor.com/Salaries/france-financial-analyst-salary-SRCH_IL.0,6_IN86_KO7,24.htm", "Germany_FinAnalyst": "https://www.glassdoor.com/Salaries/germany-financial-analyst-salary-SRCH_IL.0,7_IN96_KO8,25.htm", "UK_FinAnalyst": "https://www.glassdoor.com/Salaries/uk-financial-analyst-salary-SRCH_IL.0,2_IN2_KO3,20.htm", "USA_FinAnalyst": "https://www.glassdoor.com/Salaries/us-financial-analyst-salary-SRCH_IL.0,2_IN1_KO3,20.htm", "Spain_JrScientist": "https://www.glassdoor.com/Salaries/spain-junior-data-scientist-salary-SRCH_IL.0,5_IN219_KO6,27.htm", "France_JrScientist" :"https://www.glassdoor.com/Salaries/france-junior-data-scientist-salary-SRCH_IL.0,6_IN86_KO7,28.htm", "Germany_JrScientist" :"https://www.glassdoor.com/Salaries/germany-junior-data-scientist-salary-SRCH_IL.0,7_IN96_KO8,29.htm", "UK_JrScientist" :"https://www.glassdoor.com/Salaries/uk-junior-data-scientist-salary-SRCH_IL.0,2_IN2_KO3,24.htm", "US_JrScientist" :"https://www.glassdoor.com/Salaries/us-junior-data-scientist-salary-SRCH_IL.0,2_IN1_KO3,24.htm", "Spain_SrScientist" :"https://www.glassdoor.com/Salaries/spain-senior-data-scientist-salary-SRCH_IL.0,5_IN219_KO6,27.htm", "France_SrScientist" :"https://www.glassdoor.com/Salaries/france-senior-data-scientist-salary-SRCH_IL.0,6_IN86_KO7,28.htm", "Germany_SrScientist" :"https://www.glassdoor.com/Salaries/germany-senior-data-scientist-salary-SRCH_IL.0,7_IN96_KO8,29.htm", "UK_SrScientist" :"https://www.glassdoor.com/Salaries/uk-senior-data-scientist-salary-SRCH_IL.0,2_IN2_KO3,24.htm", "US_SrScientist" :"https://www.glassdoor.com/Salaries/us-senior-data-scientist-salary-SRCH_IL.0,2_IN1_KO3,24.htm", "Spain_JrAnalyst" :"https://www.glassdoor.com/Salaries/spain-junior-data-analyst-salary-SRCH_IL.0,5_IN219_KO6,25.htm", "France_JrAnalyst" :"https://www.glassdoor.com/Salaries/france-junior-data-analyst-salary-SRCH_IL.0,6_IN86_KO7,26.htm", "Germany_JrAnalyst" :"https://www.glassdoor.com/Salaries/germany-junior-data-analyst-salary-SRCH_IL.0,7_IN96_KO8,27.htm", "UK_JrAnalyst" :"https://www.glassdoor.com/Salaries/uk-junior-data-analyst-salary-SRCH_IL.0,2_IN2_KO3,22.htm", "USA_JrAnalyst" :"https://www.glassdoor.com/Salaries/us-junior-data-analyst-salary-SRCH_IL.0,2_IN1_KO3,22.htm", "Spain_SrAnalyst" :"https://www.glassdoor.com/Salaries/spain-senior-data-analyst-salary-SRCH_IL.0,5_IN219_KO6,25.htm", "France_SrAnalyst" :"https://www.glassdoor.com/Salaries/france-senior-data-analyst-salary-SRCH_IL.0,6_IN86_KO7,26.htm", "Germany_SrAnalyst" :"https://www.glassdoor.com/Salaries/germany-senior-data-analyst-salary-SRCH_IL.0,7_IN96_KO8,27.htm", "UK_SrAnalyst" :"https://www.glassdoor.com/Salaries/uk-senior-data-analyst-salary-SRCH_IL.0,2_IN2_KO3,22.htm", "USA_SrAnalyst" :"https://www.glassdoor.com/Salaries/us-senior-data-analyst-salary-SRCH_IL.0,2_IN1_KO3,22.htm", "Spain_JrFinAnalyst" :"https://www.glassdoor.com/Salaries/spain-junior-financial-analyst-salary-SRCH_IL.0,5_IN219_KO6,30.htm", "France_JrFinAnalyst" :"https://www.glassdoor.com/Salaries/france-junior-financial-analyst-salary-SRCH_IL.0,6_IN86_KO7,31.htm", "Germany_JrFinAnalyst" :"https://www.glassdoor.com/Salaries/germany-junior-financial-analyst-salary-SRCH_IL.0,7_IN96_KO8,32.htm", "UK_JrFinAnalyst" :"https://www.glassdoor.com/Salaries/uk-junior-financial-analyst-salary-SRCH_IL.0,2_IN2_KO3,27.htm", "USA_JrFinAnalyst" :"https://www.glassdoor.com/Salaries/us-junior-financial-analyst-salary-SRCH_IL.0,2_IN1_KO3,27.htm", "Spain_SrFinAnalyst" :"https://www.glassdoor.com/Salaries/spain-senior-financial-analyst-salary-SRCH_IL.0,5_IN219_KO6,30.htm", "France_SrFinAnalyst" :"https://www.glassdoor.com/Salaries/france-senior-financial-analyst-salary-SRCH_IL.0,6_IN86_KO7,31.htm", "Germany_SrFinAnalyst" :"https://www.glassdoor.com/Salaries/germany-senior-financial-analyst-salary-SRCH_IL.0,7_IN96_KO8,32.htm", "UK_SrFinAnalyst" :"https://www.glassdoor.com/Salaries/uk-senior-financial-analyst-salary-SRCH_IL.0,2_IN2_KO3,27.htm", "US_SrFinAnalyst": "https://www.glassdoor.com/Salaries/us-senior-financial-analyst-salary-SRCH_IL.0,2_IN1_KO3,27.htm"}

In [4]:
def vage_calculator_for(country_job):
    return extract_glassdoor_info(country_job_dict[country_job])

In [28]:
df_salaries = pd.DataFrame([vage_calculator_for(specific_job_in_country) for specific_job_in_country in country_job_dict])

In [29]:
df_salaries.columns = ["Jobs", "Country", "Salary"]

In [30]:
import re

In [31]:
df_salaries

                        Jobs  Country    Salary
0            Data Analyst is    Spain   €31,195
1            Data Analyst is  Germany   €50,399
2            Data Analyst is   France   €41,286
3            Data Analyst is  Kingdom   £30,126
4            Data Analyst is   States   $67,377
5          Data Scientist is    Spain   €37,086
6          Data Scientist is  Germany   €60,806
7          Data Scientist is   France   €45,238
8          Data Scientist is  Kingdom   £47,736
9          Data Scientist is   States  $117,345
10      Financial Analyst is    Spain   €31,346
11      Financial Analyst is   France   €47,139
12      Financial Analyst is  Germany   €63,108
13      Financial Analyst is  Kingdom   £35,948
14      Financial Analyst is   States   $65,817
15     Junior Data Scientist    Spain   €30,864
16     Junior Data Scientist   France   €41,378
17     Junior Data Scientist  Germany   €49,646
18     Junior Data Scientist  Kingdom   £35,760
19     Junior Data Scientist   States   $94,934
20     Senior Data Scientist    Spain   €41,634
21     Senior Data Scientist   France   €52,822
22     Senior Data Scientist  Germany   €75,802
23     Senior Data Scientist  Kingdom   £60,766
24     Senior Data Scientist   States  $136,633
25       Junior Data Analyst    Spain   €30,905
26       Junior Data Analyst   France   €42,263
27       Junior Data Analyst  Germany   €39,947
28       Junior Data Analyst  Kingdom   £22,613
29       Junior Data Analyst   States   $55,289
30       Senior Data Analyst    Spain   €27,357
31       Senior Data Analyst   France   €48,643
32       Senior Data Analyst  Germany   €68,129
33       Senior Data Analyst  Kingdom   £40,869
34       Senior Data Analyst   States   $83,794
35  Junior Financial Analyst    Spain   €24,771
36  Junior Financial Analyst   France   €60,388
37  Junior Financial Analyst  Germany   €36,622
38  Junior Financial Analyst  Kingdom   £21,426
39  Junior Financial Analyst   States   $57,742
40  Senior Financial Analyst    Spain   €45,592
41  Senior Financial Analyst   France   €58,845
42  Senior Financial Analyst  Germany   €74,683
43  Senior Financial Analyst  Kingdom   £53,680
44  Senior Financial Analyst   States   $83,408

In [32]:
df_salaries["Jobs"]=df_salaries["Jobs"].apply(lambda x: re.sub("\sis", "", x))

In [33]:
df_salaries

                        Jobs  Country    Salary
0               Data Analyst    Spain   €31,195
1               Data Analyst  Germany   €50,399
2               Data Analyst   France   €41,286
3               Data Analyst  Kingdom   £30,126
4               Data Analyst   States   $67,377
5             Data Scientist    Spain   €37,086
6             Data Scientist  Germany   €60,806
7             Data Scientist   France   €45,238
8             Data Scientist  Kingdom   £47,736
9             Data Scientist   States  $117,345
10         Financial Analyst    Spain   €31,346
11         Financial Analyst   France   €47,139
12         Financial Analyst  Germany   €63,108
13         Financial Analyst  Kingdom   £35,948
14         Financial Analyst   States   $65,817
15     Junior Data Scientist    Spain   €30,864
16     Junior Data Scientist   France   €41,378
17     Junior Data Scientist  Germany   €49,646
18     Junior Data Scientist  Kingdom   £35,760
19     Junior Data Scientist   States   $94,934
20     Senior Data Scientist    Spain   €41,634
21     Senior Data Scientist   France   €52,822
22     Senior Data Scientist  Germany   €75,802
23     Senior Data Scientist  Kingdom   £60,766
24     Senior Data Scientist   States  $136,633
25       Junior Data Analyst    Spain   €30,905
26       Junior Data Analyst   France   €42,263
27       Junior Data Analyst  Germany   €39,947
28       Junior Data Analyst  Kingdom   £22,613
29       Junior Data Analyst   States   $55,289
30       Senior Data Analyst    Spain   €27,357
31       Senior Data Analyst   France   €48,643
32       Senior Data Analyst  Germany   €68,129
33       Senior Data Analyst  Kingdom   £40,869
34       Senior Data Analyst   States   $83,794
35  Junior Financial Analyst    Spain   €24,771
36  Junior Financial Analyst   France   €60,388
37  Junior Financial Analyst  Germany   €36,622
38  Junior Financial Analyst  Kingdom   £21,426
39  Junior Financial Analyst   States   $57,742
40  Senior Financial Analyst    Spain   €45,592
41  Senior Financial Analyst   France   €58,845
42  Senior Financial Analyst  Germany   €74,683
43  Senior Financial Analyst  Kingdom   £53,680
44  Senior Financial Analyst   States   $83,408

In [34]:
country_table = pd.DataFrame(["Spain", "France", "Germany", "Kingdom", "States"])

In [35]:
country_table = country_table.reset_index()

In [36]:
country_table

   index        0
0      0    Spain
1      1   France
2      2  Germany
3      3  Kingdom
4      4   States

In [37]:
country_table.columns = ("country_id", "country")

In [38]:
country_table

   country_id  country
0           0    Spain
1           1   France
2           2  Germany
3           3  Kingdom
4           4   States

In [39]:
df_salaries.to_csv("df_salaries.csv")

In [40]:
df_salaries = df_salaries.merge(country_table, left_on="Country", right_on="country")

In [45]:
df_salaries

                        Jobs  Country    Salary  country_id  country
0               Data Analyst    Spain   €31,195           0    Spain
1             Data Scientist    Spain   €37,086           0    Spain
2          Financial Analyst    Spain   €31,346           0    Spain
3      Junior Data Scientist    Spain   €30,864           0    Spain
4      Senior Data Scientist    Spain   €41,634           0    Spain
5        Junior Data Analyst    Spain   €30,905           0    Spain
6        Senior Data Analyst    Spain   €27,357           0    Spain
7   Junior Financial Analyst    Spain   €24,771           0    Spain
8   Senior Financial Analyst    Spain   €45,592           0    Spain
9               Data Analyst  Germany   €50,399           2  Germany
10            Data Scientist  Germany   €60,806           2  Germany
11         Financial Analyst  Germany   €63,108           2  Germany
12     Junior Data Scientist  Germany   €49,646           2  Germany
13     Senior Data Scientist  Germany   €75,802           2  Germany
14       Junior Data Analyst  Germany   €39,947           2  Germany
15       Senior Data Analyst  Germany   €68,129           2  Germany
16  Junior Financial Analyst  Germany   €36,622           2  Germany
17  Senior Financial Analyst  Germany   €74,683           2  Germany
18              Data Analyst   France   €41,286           1   France
19            Data Scientist   France   €45,238           1   France
20         Financial Analyst   France   €47,139           1   France
21     Junior Data Scientist   France   €41,378           1   France
22     Senior Data Scientist   France   €52,822           1   France
23       Junior Data Analyst   France   €42,263           1   France
24       Senior Data Analyst   France   €48,643           1   France
25  Junior Financial Analyst   France   €60,388           1   France
26  Senior Financial Analyst   France   €58,845           1   France
27              Data Analyst  Kingdom   £30,126           3  Kingdom
28            Data Scientist  Kingdom   £47,736           3  Kingdom
29         Financial Analyst  Kingdom   £35,948           3  Kingdom
30     Junior Data Scientist  Kingdom   £35,760           3  Kingdom
31     Senior Data Scientist  Kingdom   £60,766           3  Kingdom
32       Junior Data Analyst  Kingdom   £22,613           3  Kingdom
33       Senior Data Analyst  Kingdom   £40,869           3  Kingdom
34  Junior Financial Analyst  Kingdom   £21,426           3  Kingdom
35  Senior Financial Analyst  Kingdom   £53,680           3  Kingdom
36              Data Analyst   States   $67,377           4   States
37            Data Scientist   States  $117,345           4   States
38         Financial Analyst   States   $65,817           4   States
39     Junior Data Scientist   States   $94,934           4   States
40     Senior Data Scientist   States  $136,633           4   States
41       Junior Data Analyst   States   $55,289           4   States
42       Senior Data Analyst   States   $83,794           4   States
43  Junior Financial Analyst   States   $57,742           4   States
44  Senior Financial Analyst   States   $83,408           4   States

In [48]:
df_salaries_cleaned = df_salaries.drop(columns=["Country", "country"], axis=1)

KeyError: "['Country' 'country'] not found in axis"

In [50]:
df_salaries_cleaned.to_csv("df_salaries_cleaned.csv")

In [57]:
country_table["country"] = country_table["country"].apply(lambda x: re.sub("Kingdom","United Kingdom", x))

In [58]:
country_table

   country_id         country
0           0           Spain
1           1          France
2           2         Germany
3           3  United Kingdom
4           4          States

In [59]:
country_table["country"] = country_table["country"].apply(lambda x: re.sub("States","United States", x))

In [60]:
country_table

   country_id         country
0           0           Spain
1           1          France
2           2         Germany
3           3  United Kingdom
4           4   United States

In [61]:
country_table.to_csv("df_country")